<?php
class Address {

    static function initProvinces(){
        return array(
            1=>"北京", 2=>"天津", 3=>"河北", 4=>"山西", 5=>"内蒙古", 6=>"辽宁", 7=>"吉林", 8=>"黑龙江", 9=>"上海", 10=>"江苏", 11=>"浙江", 12=>"安徽", 13=>"福建", 14=>"江西", 15=>"山东", 16=>"河南", 17=>"湖北", 18=>"湖南", 19=>"广东", 20=>"广西", 21=>"海南", 22=>"重庆", 23=>"四川", 24=>"贵州", 25=>"云南", 26=>"西藏", 27=>"陕西", 28=>"甘肃", 29=>"青海", 30=>"宁夏", 31=>"新疆", 32=>"台湾", 33=>"香港", 34=>"澳门", 35=>"海外",
        );
    }

    static function initCitys(){
        return array(
            1=>array(36=>"北京市",),
            2=>array(40=>"天津市",),
            3=>array(73=>"石家庄市",74=>"唐山市",75=>"秦皇岛市",76=>"邯郸市",77=>"邢台市",78=>"保定市",79=>"张家口市",80=>"承德市",81=>"衡水市",82=>"廊坊市",83=>"沧州市",),
            4=>array(84=>"太原市",85=>"大同市",86=>"阳泉市",87=>"长治市",88=>"晋城市",89=>"朔州市",90=>"晋中市",91=>"运城市",92=>"忻州市",93=>"临汾市",94=>"吕梁市",),
            5=>array(95=>"呼和浩特市",96=>"包头市",97=>"乌海市",98=>"赤峰市",99=>"通辽市",100=>"鄂尔多斯市",101=>"呼伦贝尔市",102=>"巴彦淖尔市",103=>"乌兰察布市",104=>"兴安盟",105=>"锡林郭勒盟",106=>"阿拉善盟",),
            6=>array(107=>"沈阳市",108=>"大连市",109=>"鞍山市",110=>"抚顺市",111=>"本溪市",112=>"丹东市",113=>"锦州市",114=>"营口市",115=>"阜新市",116=>"辽阳市",117=>"盘锦市",118=>"铁岭市",119=>"朝阳市",120=>"葫芦岛市",),
            7=>array(121=>"长春市",122=>"吉林市",123=>"四平市",124=>"辽源市",125=>"通化市",126=>"白山市",127=>"松原市",128=>"白城市",129=>"延边朝鲜族自治州",),
            8=>array(130=>"哈尔滨市",131=>"齐齐哈尔市",132=>"鸡西市",133=>"鹤岗市",134=>"双鸭山市",135=>"大庆市",136=>"伊春市",137=>"佳木斯市",138=>"七台河市",139=>"牡丹江市",140=>"黑河市",141=>"绥化市",142=>"大兴安岭地区",),
            9=>array(39=>"上海市",),
            10=>array(162=>"南京市",163=>"无锡市",164=>"徐州市",165=>"常州市",166=>"苏州市",167=>"南通市",168=>"连云港市",169=>"淮安市",170=>"盐城市",171=>"扬州市",172=>"镇江市",173=>"泰州市",174=>"宿迁市",),
            11=>array(175=>"杭州市",176=>"宁波市",177=>"温州市",178=>"嘉兴市",179=>"湖州市",180=>"绍兴市",181=>"舟山市",182=>"衢州市",183=>"金华市",184=>"台州市",185=>"丽水市",),
            12=>array(186=>"合肥市",187=>"芜湖市",188=>"蚌埠市",189=>"淮南市",190=>"马鞍山市",191=>"淮北市",192=>"铜陵市",193=>"安庆市",194=>"黄山市",195=>"滁州市",196=>"阜阳市",197=>"宿州市",198=>"巢湖市",199=>"六安市",200=>"亳州市",201=>"池州市",202=>"宣城市",),
            13=>array(203=>"福州市",204=>"厦门市",205=>"莆田市",206=>"三明市",207=>"泉州市",208=>"漳州市",209=>"南平市",210=>"龙岩市",211=>"宁德市",),
            14=>array(212=>"南昌市",213=>"景德镇市",214=>"萍乡市",215=>"九江市",216=>"新余市",217=>"鹰潭市",218=>"赣州市",219=>"吉安市",220=>"宜春市",221=>"抚州市",222=>"上饶市",),
            15=>array(223=>"济南市",224=>"青岛市",225=>"淄博市",226=>"枣庄市",227=>"东营市",228=>"烟台市",229=>"潍坊市",230=>"济宁市",231=>"泰安市",232=>"威海市",233=>"日照市",234=>"莱芜市",235=>"临沂市",236=>"德州市",237=>"聊城市",238=>"滨州市",239=>"菏泽市",),
            16=>array(240=>"郑州市",241=>"开封市",242=>"洛阳市",243=>"平顶山市",244=>"安阳市",245=>"鹤壁市",246=>"新乡市",247=>"焦作市",248=>"濮阳市",249=>"许昌市",250=>"漯河市",251=>"三门峡市",252=>"南阳市",253=>"商丘市",254=>"信阳市",255=>"周口市",256=>"驻马店市",257=>"济源市",),
            17=>array(258=>"武汉市",259=>"黄石市",260=>"十堰市",261=>"宜昌市",262=>"襄樊市",263=>"鄂州市",264=>"荆门市",265=>"孝感市",266=>"荆州市",267=>"黄冈市",268=>"咸宁市",269=>"随州市",270=>"恩施土家族苗族自治州",271=>"仙桃市",272=>"潜江市",273=>"天门市",274=>"神农架林区",),
            18=>array(275=>"长沙市",276=>"株洲市",277=>"湘潭市",278=>"衡阳市",279=>"邵阳市",280=>"岳阳市",281=>"常德市",282=>"张家界市",283=>"益阳市",284=>"郴州市",285=>"永州市",286=>"怀化市",287=>"娄底市",288=>"湘西土家族苗族自治州",),
            19=>array(289=>"广州市",290=>"韶关市",291=>"深圳市",292=>"珠海市",293=>"汕头市",294=>"佛山市",295=>"江门市",296=>"湛江市",297=>"茂名市",298=>"肇庆市",299=>"惠州市",300=>"梅州市",301=>"汕尾市",302=>"河源市",303=>"阳江市",304=>"清远市",305=>"东莞市",306=>"中山市",307=>"潮州市",308=>"揭阳市",309=>"云浮市",),
            20=>array(310=>"南宁市",311=>"柳州市",312=>"桂林市",313=>"梧州市",314=>"北海市",315=>"防城港市",316=>"钦州市",317=>"贵港市",318=>"玉林市",319=>"百色市",320=>"贺州市",321=>"河池市",322=>"来宾市",323=>"崇左市",),
            21=>array(324=>"海口市",325=>"三亚市",326=>"五指山市",327=>"琼海市",328=>"儋州市",329=>"文昌市",330=>"万宁市",331=>"东方市",332=>"定安县",333=>"屯昌县",334=>"澄迈县",335=>"临高县",336=>"白沙黎族自治县",337=>"昌江黎族自治县",338=>"乐东黎族自治县",339=>"陵水黎族自治县",340=>"保亭黎族苗族自治县",341=>"琼中黎族苗族自治县",342=>"西沙群岛",343=>"南沙群岛",344=>"中沙群岛的岛礁及其海域",),
            22=>array(62=>"重庆市",),
            23=>array(385=>"成都市",386=>"自贡市",387=>"攀枝花市",388=>"泸州市",389=>"德阳市",390=>"绵阳市",391=>"广元市",392=>"遂宁市",393=>"内江市",394=>"乐山市",395=>"南充市",396=>"眉山市",397=>"宜宾市",398=>"广安市",399=>"达州市",400=>"雅安市",401=>"巴中市",402=>"资阳市",403=>"阿坝藏族羌族自治州",404=>"甘孜藏族自治州",405=>"凉山彝族自治州",),
            24=>array(406=>"贵阳市",407=>"六盘水市",408=>"遵义市",409=>"安顺市",410=>"铜仁地区",411=>"黔西南布依族苗族自治州",412=>"毕节地区",413=>"黔东南苗族侗族自治州",414=>"黔南布依族苗族自治州",),
            25=>array(415=>"昆明市",416=>"曲靖市",417=>"玉溪市",418=>"保山市",419=>"昭通市",420=>"丽江市",421=>"思茅市",422=>"临沧市",423=>"楚雄彝族自治州",424=>"红河哈尼族彝族自治州",425=>"文山壮族苗族自治州",426=>"西双版纳傣族自治州",427=>"大理白族自治州",428=>"德宏傣族景颇族自治州",429=>"怒江傈僳族自治州",430=>"迪庆藏族自治州",),
            26=>array(431=>"拉萨市",432=>"昌都地区",433=>"山南地区",434=>"日喀则地区",435=>"那曲地区",436=>"阿里地区",437=>"林芝地区",),
            27=>array(438=>"西安市",439=>"铜川市",440=>"宝鸡市",441=>"咸阳市",442=>"渭南市",443=>"延安市",444=>"汉中市",445=>"榆林市",446=>"安康市",447=>"商洛市",),
            28=>array(448=>"兰州市",449=>"嘉峪关市",450=>"金昌市",451=>"白银市",452=>"天水市",453=>"武威市",454=>"张掖市",455=>"平凉市",456=>"酒泉市",457=>"庆阳市",458=>"定西市",459=>"陇南市",460=>"临夏回族自治州",461=>"甘南藏族自治州",),
            29=>array(462=>"西宁市",463=>"海东地区",464=>"海北藏族自治州",465=>"黄南藏族自治州",466=>"海南藏族自治州",467=>"果洛藏族自治州",468=>"玉树藏族自治州",469=>"海西蒙古族藏族自治州",),
            30=>array(470=>"银川市",471=>"石嘴山市",472=>"吴忠市",473=>"固原市",474=>"中卫市",),
            31=>array(475=>"乌鲁木齐市",476=>"克拉玛依市",477=>"吐鲁番地区",478=>"哈密地区",479=>"昌吉回族自治州",480=>"博尔塔拉蒙古自治州",481=>"巴音郭楞蒙古自治州",482=>"阿克苏地区",483=>"克孜勒苏柯尔克孜自治州",484=>"喀什地区",485=>"和田地区",486=>"伊犁哈萨克自治州",487=>"塔城地区",488=>"阿勒泰地区",489=>"石河子市",490=>"阿拉尔市",491=>"图木舒克市",492=>"五家渠市",),
            32=>array(493=>"台北市",494=>"高雄市",495=>"基隆市",496=>"台中市",497=>"台南市",498=>"新竹市",499=>"嘉义市",500=>"台北县",501=>"宜兰县",502=>"桃园县",503=>"新竹县",504=>"苗栗县",505=>"台中县",506=>"彰化县",507=>"南投县",508=>"云林县",509=>"嘉义县",510=>"台南县",511=>"高雄县",512=>"屏东县",513=>"澎湖县",514=>"台东县",515=>"花莲县",),
            33=>array(516=>"中西区",517=>"东区",518=>"九龙城区",519=>"观塘区",520=>"南区",521=>"深水埗区",522=>"黄大仙区",523=>"湾仔区",524=>"油尖旺区",525=>"离岛区",526=>"葵青区",527=>"北区",528=>"西贡区",529=>"沙田区",530=>"屯门区",531=>"大埔区",532=>"荃湾区",533=>"元朗区",),
            34=>array(534=>"澳门特别行政区",),
            35=>array(45055=>"海外",),
        );  
    }

    static function initAreas() {
        return array(
            36=>array("东城区","西城区","朝阳区","丰台区","石景山区","海淀区","门头沟区","房山区","通州区","顺义区","昌平区","大兴区","怀柔区","平谷区","密云县","延庆县","其他",),
            39=>array("黄浦区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","闵行区","宝山区","嘉定区","浦东新区","金山区","松江区","青浦区","南汇区","奉贤区","崇明县",),
            40=>array("和平区","河东区","河西区","南开区","河北区","红桥区","滨海新区","东丽区","西青区","津南区","北辰区","武清区","宝坻区","宁河县","静海县","蓟县",),
            62=>array("万州区","涪陵区","渝中区","大渡口区","江北区","沙坪坝区","九龙坡区","南岸区","北碚区","双桥区","万盛区","渝北区","巴南区","黔江区","长寿区","綦江县","潼南县","铜梁县","大足县","荣昌县","璧山县","梁平县","城口县","丰都县","垫江县","武隆县","忠县","开县","云阳县","奉节县","巫山县","巫溪县","石柱土家族自治县","秀山土家族苗族自治县","酉阳土家族苗族自治县","彭水苗族土家族自治县","江津市","合川市","永川市","南川市",),
            73=>array("井陉县","井陉矿区","元氏县","平山县","新乐市","新华区","无极县","晋州市","栾城县","桥东区","桥西区","正定县","深泽县","灵寿县","藁城市","行唐县","裕华区","赞皇县","赵县","辛集市","长安区","高邑县","鹿泉市",),
            74=>array("丰南区","丰润区","乐亭县","古冶区","唐海县","开平区","滦南县","滦县","玉田县","路北区","路南区","迁安市","迁西县","遵化市",),
            75=>array("北戴河区","卢龙县","山海关区","抚宁县","昌黎县","海港区","青龙满族自治县",),
            76=>array("丛台区","临漳县","复兴区","大名县","峰峰矿区","广平县","成安县","曲周县","武安市","永年县","涉县","磁县","肥乡县","邯山区","邯郸县","邱县","馆陶县","魏县","鸡泽县",),
            77=>array("临城县","临西县","任县","内丘县","南和县","南宫市","威县","宁晋县","巨鹿县","平乡县","广宗县","新河县","柏乡县","桥东区","桥西区","沙河市","清河县","邢台县","隆尧县",),
            78=>array("北市区","南市区","博野县","唐县","安国市","安新县","定兴县","定州市","容城县","徐水县","新市区","易县","曲阳县","望都县","涞水县","涞源县","涿州市","清苑县","满城县","蠡县","阜平县","雄县","顺平县","高碑店市","高阳县",),
            79=>array("万全县","下花园区","宣化区","宣化县","尚义县","崇礼县","康保县","张北县","怀安县","怀来县","桥东区","桥西区","沽源县","涿鹿县","蔚县","赤城县","阳原县",),
            80=>array("丰宁满族自治县","兴隆县","双桥区","双滦区","围场满族蒙古族自治县","宽城满族自治县","平泉县","承德县","滦平县","隆化县","鹰手营子矿区",),
            81=>array("冀州市","安平县","故城县","景县","枣强县","桃城区","武强县","武邑县","深州市","阜城县","饶阳县",),
            82=>array("三河市","固安县","大厂回族自治县","大城县","安次区","广阳区","文安县","永清县","霸州市","香河县",),
            83=>array("东光县","任丘市","南皮县","吴桥县","孟村回族自治县","新华区","沧县","河间市","泊头市","海兴县","献县","盐山县","肃宁县","运河区","青县","黄骅市",),
            84=>array("万柏林区","古交市","娄烦县","小店区","尖草坪区","晋源区","杏花岭区","清徐县","迎泽区","阳曲县",),
            85=>array("南郊区","城区","大同县","天镇县","左云县","广灵县","新荣区","浑源县","灵丘县","矿区","阳高县",),
            86=>array("城区","平定县","盂县","矿区","郊区",),
            87=>array("城区","壶关县","屯留县","平顺县","武乡县","沁县","沁源县","潞城市","襄垣县","郊区","长子县","长治县","黎城县",),
            88=>array("城区","沁水县","泽州县","阳城县","陵川县","高平市",),
            89=>array("右玉县","山阴县","平鲁区","应县","怀仁县","朔城区",),
            90=>array("介休市","和顺县","太谷县","寿阳县","左权县","平遥县","昔阳县","榆次区","榆社县","灵石县","祁县",),
            91=>array("万荣县","临猗县","垣曲县","夏县","平陆县","新绛县","永济市","河津市","盐湖区","稷山县","绛县","芮城县","闻喜县",),
            92=>array("五台县","五寨县","代县","保德县","偏关县","原平市","宁武县","定襄县","岢岚县","忻府区","河曲县","神池县","繁峙县","静乐县",),
            93=>array("乡宁县","侯马市","古县","吉县","大宁县","安泽县","尧都区","曲沃县","永和县","汾西县","洪洞县","浮山县","翼城县","蒲县","襄汾县","隰县","霍州市",),
            94=>array("中阳县","临县","交口县","交城县","兴县","孝义市","岚县","文水县","方山县","柳林县","汾阳市","石楼县","离石区",),
            95=>array("和林格尔县","回民区","土默特左旗","托克托县","新城区","武川县","清水河县","玉泉区","赛罕区",),
            96=>array("东河区","九原区","固阳县","土默特右旗","昆都仑区","白云矿区","石拐区","达尔罕茂明安联合旗","青山区",),
            97=>array("乌达区","海勃湾区","海南区",),
            98=>array("元宝山区","克什克腾旗","喀喇沁旗","宁城县","巴林右旗","巴林左旗","敖汉旗","松山区","林西县","红山区","翁牛特旗","阿鲁科尔沁旗",),
            99=>array("奈曼旗","库伦旗","开鲁县","扎鲁特旗","科尔沁区","科尔沁左翼中旗","科尔沁左翼后旗","霍林郭勒市",),
            100=>array("东胜区","乌审旗","伊金霍洛旗","准格尔旗","杭锦旗","达拉特旗","鄂东胜区","鄂托克前旗","鄂托克旗",),
            101=>array("扎兰屯市","新巴尔虎右旗","新巴尔虎左旗","根河市","海拉尔区","满洲里市","牙克石市","莫力达瓦达斡尔族自治旗","鄂伦春自治旗","鄂温克族自治旗","阿荣旗","陈巴尔虎旗","额尔古纳市",),
            102=>array("临河区","乌拉特中旗","乌拉特前旗","乌拉特后旗","五原县","杭锦后旗","磴口县",),
            103=>array("丰镇市","兴和县","凉城县","化德县","卓资县","商都县","四子王旗","察哈尔右翼中旗","察哈尔右翼前旗","察哈尔右翼后旗","集宁区",),
            104=>array("乌兰浩特市","扎赉特旗","科尔沁右翼中旗","科尔沁右翼前旗","突泉县","阿尔山市",),
            105=>array("东乌珠穆沁旗","二连浩特市","多伦县","太仆寺旗","正蓝旗","正镶白旗","苏尼特右旗","苏尼特左旗","西乌珠穆沁旗","锡林浩特市","镶黄旗","阿巴嘎旗",),
            106=>array("阿拉善右旗","阿拉善左旗","额济纳旗",),
            107=>array("东陵区","于洪区","和平区","大东区","康平县","新民市","沈北新区","沈河区","法库县","皇姑区","苏家屯区","辽中县","铁西区",),
            108=>array("中山区","庄河市","旅顺口区","普兰店市","沙河口区","瓦房店市","甘井子区","西岗区","金州区","长海县",),
            109=>array("千山区","台安县","岫岩满族自治县","海城市","立山区","铁东区","铁西区",),
            110=>array("东洲区","抚顺县","新宾满族自治县","新抚区","望花区","清原满族自治县","顺城区",),
            111=>array("南芬区","平山区","明山区","本溪满族自治县","桓仁满族自治县","溪湖区",),
            112=>array("东港市","元宝区","凤城市","宽甸满族自治县","振兴区","振安区",),
            113=>array("义县","凌河区","凌海市","北镇市","古塔区","太和区","黑山县",),
            114=>array("大石桥市","盖州市","站前区","老边区","西市区","鲅鱼圈区",),
            115=>array("太平区","彰武县","新邱区","海州区","清河门区","细河区","蒙古族自治县",),
            116=>array("太子河区","宏伟区","弓长岭区","文圣区","灯塔市","白塔区","辽阳县",),
            117=>array("兴隆台区","双台子区","大洼县","盘山县",),
            118=>array("开原市","昌图县","清河区","西丰县","调兵山市","铁岭县","银州区",),
            119=>array("凌源市","北票市","双塔区","喀喇沁左翼蒙古族自治县","建平县","朝阳县","龙城区",),
            120=>array("兴城市","南票区","建昌县","绥中县","连山区","龙港区",),
            121=>array("九台市","二道区","农安县","南关区","双阳区","宽城区","德惠市","朝阳区","榆树市","绿园区",),
            122=>array("丰满区","昌邑区","桦甸市","永吉县","磐石市","舒兰市","船营区","蛟河市","龙潭区",),
            123=>array("伊通满族自治县","公主岭市","双辽市","梨树县","铁东区","铁西区",),
            124=>array("东丰县","东辽县","西安区","龙山区",),
            125=>array("东昌区","二道江区","柳河县","梅河口市","辉南县","通化县","集安市",),
            126=>array("临江市","八道江区","抚松县","江源区","长白朝鲜族自治县","靖宇县",),
            127=>array("干安县","前郭尔罗斯蒙古族自治县","宁江区","扶余县","长岭县",),
            128=>array("大安市","洮北区","洮南市","通榆县","镇赉县",),
            129=>array("和龙市","图们市","安图县","延吉市","敦化市","汪清县","珲春市","龙井市",),
            130=>array("五常市","依兰县","南岗区","双城市","呼兰区","哈尔滨市道里区","宾县","尚志市","巴彦县","平房区","延寿县","方正县","木兰县","松北区","通河县","道外区","阿城区","香坊区",),
            131=>array("依安县","克东县","克山县","富拉尔基区","富裕县","建华区","拜泉县","昂昂溪区","梅里斯达斡尔族区","泰来县","甘南县","碾子山区","讷河市","铁锋区","龙江县","龙沙区",),
            132=>array("城子河区","密山市","恒山区","梨树区","滴道区","虎林市","鸡东县","鸡冠区","麻山区",),
            133=>array("东山区","兴安区","兴山区","南山区","向阳区","工农区","绥滨县","萝北县",),
            134=>array("友谊县","四方台区","宝山区","宝清县","尖山区","岭东区","集贤县","饶河县",),
            135=>array("大同区","杜尔伯特蒙古族自治县","林甸县","红岗区","肇州县","肇源县","胡路区","萨尔图区","龙凤区",),
            136=>array("上甘岭区","乌伊岭区","乌马河区","五营区","伊春区","南岔区","友好区","嘉荫县","带岭区","新青区","汤旺河区","红星区","美溪区","翠峦区","西林区","金山屯区","铁力市",),
            137=>array("东风区","前进区","同江市","向阳区","富锦市","抚远县","桦南县","桦川县","汤原县","郊区",),
            138=>array("勃利县","新兴区","桃山区","茄子河区",),
            139=>array("东宁县","东安区","宁安市","林口县","海林市","爱民区","穆棱市","绥芬河市","西安区","阳明区",),
            140=>array("五大连池市","北安市","嫩江县","孙吴县","爱辉区","车逊克县","逊克县",),
            141=>array("兰西县","安达市","庆安县","明水县","望奎县","海伦市","绥化市北林区","绥棱县","肇东市","青冈县",),
            142=>array("呼玛县","塔河县","大兴安岭地区加格达奇区","大兴安岭地区呼中区","大兴安岭地区新林区","大兴安岭地区松岭区","漠河县",),
            162=>array("下关区","六合区","建邺区","栖霞区","江宁区","浦口区","溧水县","玄武区","白下区","秦淮区","雨花台区","高淳县","鼓楼区",),
            163=>array("北塘区","南长区","宜兴市","崇安区","惠山区","江阴市","滨湖区","锡山区",),
            164=>array("丰县","九里区","云龙区","新沂市","沛县","泉山区","睢宁县","贾汪区","邳州市","铜山县","鼓楼区",),
            165=>array("天宁区","戚墅堰区","新北区","武进区","溧阳市","金坛市","钟楼区",),
            166=>array("吴中区","吴江市","太仓市","常熟市","平江区","张家港市","昆山市","沧浪区","相城区","苏州工业园区","虎丘区","金阊区",),
            167=>array("启东市","如东县","如皋市","崇川区","海安县","海门市","港闸区","通州市",),
            168=>array("东海县","新浦区","海州区","灌云县","灌南县","赣榆县","连云区",),
            169=>array("楚州区","洪泽县","涟水县","淮阴区","清河区","清浦区","盱眙县","金湖县",),
            170=>array("东台市","亭湖区","响水县","大丰市","射阳县","建湖县","滨海县","盐都区","阜宁县",),
            171=>array("仪征市","宝应县","广陵区","江都市","维扬区","邗江区","高邮市",),
            172=>array("丹徒区","丹阳市","京口区","句容市","扬中市","润州区",),
            173=>array("兴化市","姜堰市","泰兴市","海陵区","靖江市","高港区",),
            174=>array("宿城区","宿豫区","沭阳县","泗洪县","泗阳县",),
            175=>array("上城区","下城区","临安市","余杭区","富阳市","建德市","拱墅区","桐庐县","江干区","淳安县","滨江区","萧山区","西湖区",),
            176=>array("余姚市","北仑区","奉化市","宁海县","慈溪市","江东区","江北区","海曙区","象山县","鄞州区","镇海区",),
            177=>array("乐清市","平阳县","文成县","永嘉县","泰顺县","洞头县","瑞安市","瓯海区","苍南县","鹿城区","龙湾区",),
            178=>array("南湖区","嘉善县","平湖市","桐乡市","海宁市","海盐县","秀洲区",),
            179=>array("南浔区","吴兴区","安吉县","德清县","长兴县",),
            180=>array("上虞市","嵊州市","新昌县","绍兴县","诸暨市","越城区",),
            181=>array("定海区","岱山县","嵊泗县","普陀区",),
            182=>array("常山县","开化县","柯城区","江山市","衢江区","龙游县",),
            183=>array("东阳市","义乌市","兰溪市","婺城区","武义县","永康市","浦江县","磐安县","金东区",),
            184=>array("三门县","临海市","仙居县","天台县","椒江区","温岭市","玉环县","路桥区","黄岩区",),
            185=>array("云和县","庆元县","景宁畲族自治县","松阳县","缙云县","莲都区","遂昌县","青田县","龙泉市",),
            186=>array("包河区","庐阳区","瑶海区","肥东县","肥西县","蜀山区","长丰县",),
            187=>array("三山区","南陵县","弋江区","繁昌县","芜湖县","镜湖区","鸠江区",),
            188=>array("五河县","固镇县","怀远县","淮上区","禹会区","蚌山区","龙子湖区",),
            189=>array("八公山区","凤台县","大通区","潘集区","田家庵区","谢家集区",),
            190=>array("当涂县","花山区","金家庄区","雨山区",),
            191=>array("杜集区","濉溪县","烈山区","相山区",),
            192=>array("狮子山区","郊区","铜官山区","铜陵县",),
            193=>array("大观区","太湖县","宜秀区","宿松县","岳西县","怀宁县","望江县","枞阳县","桐城市","潜山县","迎江区",),
            194=>array("休宁县","屯溪区","徽州区","歙县","祁门县","黄山区","黟县",),
            195=>array("全椒县","凤阳县","南谯区","天长市","定远县","明光市","来安县","琅玡区",),
            196=>array("临泉县","太和县","界首市","阜南县","颍东区","颍州区","颍泉区","颖上县",),
            197=>array("埇桥区","泗县辖","灵璧县","砀山县","萧县",),
            198=>array("含山县","和县","居巢区","庐江县","无为县",),
            199=>array("寿县","舒城县","裕安区","金安区","金寨县","霍山县","霍邱县",),
            200=>array("利辛县","涡阳县","蒙城县","谯城区",),
            201=>array("东至县","石台县","贵池区","青阳县",),
            202=>array("宁国市","宣州区","广德县","旌德县","泾县","绩溪县","郎溪县",),
            203=>array("仓山区","台江区","平潭县","晋安区","永泰县","福清市","罗源县","连江县","长乐市","闽侯县","闽清县","马尾区","鼓楼区",),
            204=>array("同安区","思明区","海沧区","湖里区","翔安区","集美区",),
            205=>array("仙游县","城厢区","涵江区","秀屿区","荔城区",),
            206=>array("三元区","大田县","宁化县","将乐县","尤溪县","建宁县","明溪县","梅列区","永安市","沙县","泰宁县","清流县",),
            207=>array("丰泽区","南安市","安溪县","德化县","惠安县","晋江市","永春县","泉港区","洛江区","石狮市","金门县","鲤城区",),
            208=>array("东山县","云霄县","华安县","南靖县","平和县","漳浦县","芗城区","诏安县","长泰县","龙文区","龙海市",),
            209=>array("光泽县","延平区","建瓯市","建阳市","政和县","松溪县","武夷山市","浦城县","邵武市","顺昌县",),
            210=>array("上杭县","新罗区","武平县","永定县","漳平市","连城县","长汀县",),
            211=>array("古田县","周宁县","寿宁县","屏南县","柘荣县","福安市","福鼎市","蕉城区","霞浦县",),
            212=>array("东湖区","南昌县","安义县","新建县","湾里区","西湖区","进贤县","青云谱区","青山湖区",),
            213=>array("乐平市","昌江区","浮梁县","珠山区",),
            214=>array("上栗县","安源区","湘东区","芦溪县","莲花县",),
            215=>array("九江县","修水县","庐山区","彭泽县","德安县","星子县","武宁县","永修县","浔阳区","湖口县","瑞昌市","都昌县",),
            216=>array("分宜县","渝水区",),
            217=>array("余江县","月湖区","贵溪市",),
            218=>array("上犹县","于都县","会昌县","信丰县","全南县","兴国县","南康市","大余县","宁都县","安远县","定南县","寻乌县","崇义县","瑞金市","石城县","章贡区","赣县","龙南县",),
            219=>array("万安县","井冈山市","吉安县","吉州区","吉水县","安福县","峡江县","新干县","永丰县","永新县","泰和县","遂川县","青原区",),
            220=>array("万载县","上高县","丰城市","奉新县","宜丰县","樟树市","袁州区","铜鼓县","靖安县","高安市",),
            221=>array("东乡县","临川区","乐安县","南丰县","南城县","宜黄县","崇仁县","广昌县","资溪县","金溪县","黎川县",),
            222=>array("万年县","上饶县","余干县","信州区","婺源县","广丰县","弋阳县","德兴市","横峰县","玉山县","鄱阳县","铅山县",),
            223=>array("历下区","历城区","商河县","天桥区","市中区","平阴县","槐荫区","济阳县","章丘市","长清区",),
            224=>array("即墨市","四方区","城阳区","崂山区","市北区","市南区","平度市","李沧区","胶南市","胶州市","莱西市","黄岛区",),
            225=>array("临淄区","博山区","周村区","张店区","桓台县","沂源县","淄川区","高青县",),
            226=>array("台儿庄区","山亭区","峄城区","市中区","滕州市","薛城区",),
            227=>array("东营区","利津县","垦利县","广饶县","河口区",),
            228=>array("招远市","栖霞市","海阳市","牟平区","福山区","芝罘区","莱山区","莱州市","莱阳市","蓬莱市","长岛县","龙口市",),
            229=>array("临朐县","坊子区","奎文区","安丘市","寒亭区","寿光市","昌乐县","昌邑市","潍城区","诸城市","青州市","高密市",),
            230=>array("任城区","兖州市","嘉祥县","市中区","微山县","曲阜市","梁山县","汶上县","泗水县","邹城市","金乡县","鱼台县",),
            231=>array("东平县","宁阳县","岱岳区","新泰市","泰山区","肥城市",),
            232=>array("乳山市","文登市","环翠区","荣成市",),
            233=>array("东港区","五莲县","岚山区","莒县",),
            234=>array("莱城区","钢城区",),
            235=>array("临沭县","兰山区","平邑县","沂南县","沂水县","河东区","罗庄区","苍山县","莒南县","蒙阴县","费县","郯城县",),
            236=>array("临邑县","乐陵市","夏津县","宁津县","平原县","庆云县","德城区","武城县","禹城市","陵县","齐河县",),
            237=>array("东昌府区","东阿县","临清市","冠县","茌平县","莘县","阳谷县","高唐县",),
            238=>array("博兴县","惠民县","无棣县","沾化县","滨城区","邹平县","阳信县",),
            239=>array("东明县","单县","定陶县","巨野县","成武县","曹县","牡丹区","郓城县","鄄城县",),
            240=>array("上街区","中原区","中牟县","二七区","巩义市","惠济区","新密市","新郑市","登封市","管城回族区","荥阳市","金水区",),
            241=>array("兰考县","尉氏县","开封县","杞县","禹王台区","通许县","金明区","顺河回族区","鼓楼区","龙亭区",),
            242=>array("伊川县","偃师市","吉利区","孟津县","宜阳县","嵩县","新安县","栾川县","汝阳县","洛宁县","洛龙区","涧西区","瀍河回族区","老城区","西工区",),
            243=>array("卫东区","叶县","宝丰县","新华区","汝州市","湛河区","石龙区","舞钢市","郏县","鲁山县",),
            244=>array("内黄县","北关区","安阳县","文峰区","林州市","殷都区","汤阴县","滑县","龙安区",),
            245=>array("山城区","浚县","淇县","淇滨区","鹤山区",),
            246=>array("凤泉区","卫滨区","卫辉市","原阳县","封丘县","延津县","新乡县","牧野区","红旗区","获嘉县","辉县市","长垣县",),
            247=>array("中站区","修武县","博爱县","孟州市","山阳区","武陟县","沁阳市","温县","解放区","马村区",),
            248=>array("华龙区","南乐县","台前县","清丰县","濮阳县","范县",),
            249=>array("禹州市","襄城县","许昌县","鄢陵县","长葛市","魏都区",),
            250=>array("临颍县","召陵区","源汇区","舞阳县","郾城区",),
            251=>array("义马市","卢氏县","渑池县","湖滨区","灵宝市","陕县",),
            252=>array("内乡县","南召县","卧龙区","唐河县","宛城区","新野县","方城县","桐柏县","淅川县","社旗县","西峡县","邓州市","镇平县",),
            253=>array("夏邑县","宁陵县","柘城县","民权县","永城市","睢县","睢阳区","粱园区","虞城县",),
            254=>array("光山县","商城县","固始县","平桥区","息县","新县","浉河区","淮滨县","潢川县","罗山县",),
            255=>array("商水县","太康县","川汇区","扶沟县","沈丘县","淮阳县","西华县","郸城县","项城市","鹿邑县",),
            256=>array("上蔡县","平舆县","新蔡县","正阳县","汝南县","泌阳县","确山县","西平县","遂平县","驿城区",),
            257=>array("济源市",),
            258=>array("东西湖区","新洲区","武昌区","汉南区","汉阳区","江夏区","江岸区","江汉区","洪山区","硚口区","蔡甸区","青山区","黄陂区",),
            259=>array("下陆区","大冶市","西塞山区","铁山区","阳新县","黄石港区",),
            260=>array("丹江口市","张湾区","房县","竹山县","竹溪县","茅箭区","郧县","郧西县",),
            261=>array("五峰土家族自治县","伍家岗区","兴山县","夷陵区","宜都市","当阳市","枝江市","点军区","秭归县","虢亭区","西陵区","远安县","长阳土家族自治县",),
            262=>array("保康县","南漳县","宜城市","枣阳市","樊城区","老河口市","襄城区","襄阳区","谷城县",),
            263=>array("华容区","粱子湖","鄂城区",),
            264=>array("东宝区","京山县","掇刀区","沙洋县","钟祥市",),
            265=>array("云梦县","大悟县","孝南区","孝昌县","安陆市","应城市","汉川市",),
            266=>array("公安县","松滋市","江陵县","沙市区","洪湖市","监利县","石首市","荆州区",),
            267=>array("团风县","武穴市","浠水县","红安县","罗田县","英山县","蕲春县","麻城市","黄州区","黄梅县",),
            268=>array("咸安区","嘉鱼县","崇阳县","赤壁市","通城县","通山县",),
            269=>array("广水市","曾都区",),
            270=>array("利川市","咸丰县","宣恩县","巴东县","建始县","恩施市","来凤县","鹤峰县",),
            271=>array("仙桃市",),
            272=>array("潜江市",),
            273=>array("天门市",),
            274=>array("神农架林区",),
            275=>array("天心区","宁乡县","岳麓区","开福区","望城县","浏阳市","芙蓉区","长沙县","雨花区",),
            276=>array("天元区","攸县","株洲县","炎陵县","石峰区","芦淞区","茶陵县","荷塘区","醴陵市",),
            277=>array("岳塘区","湘乡市","湘潭县","雨湖区","韶山市",),
            278=>array("南岳区","常宁市","珠晖区","石鼓区","祁东县","耒阳市","蒸湘区","衡东县","衡南县","衡山县","衡阳县","雁峰区",),
            279=>array("北塔区","双清区","城步苗族自治县","大祥区","新宁县","新邵县","武冈市","洞口县","绥宁县","邵东县","邵阳县","隆回县",),
            280=>array("临湘市","云溪区","华容县","君山区","岳阳县","岳阳楼区","平江县","汨罗市","湘阴县",),
            281=>array("临澧县","安乡县","桃源县","武陵区","汉寿县","津市市","澧县","石门县","鼎城区",),
            282=>array("慈利县","桑植县","武陵源区","永定区",),
            283=>array("南县","安化县","桃江县","沅江市","资阳区","赫山区",),
            284=>array("临武县","北湖区","嘉禾县","安仁县","宜章县","桂东县","桂阳县","永兴县","汝城县","苏仙区","资兴市",),
            285=>array("东安县","冷水滩区","双牌县","宁远县","新田县","江华瑶族自治县","江永县","祁阳县","蓝山县","道县","零陵区",),
            286=>array("中方县","会同县","新晃侗族自治县","沅陵县","洪江市/洪江区","溆浦县","芷江侗族自治县","辰溪县","通道侗族自治县","靖州苗族侗族自治县","鹤城区","麻阳苗族自治县",),
            287=>array("冷水江市","双峰县","娄星区","新化县","涟源市",),
            288=>array("保靖县","凤凰县","古丈县","吉首市","永顺县","泸溪县","花垣县","龙山县",),
            289=>array("萝岗区","南沙区","从化市","增城市","天河区","海珠区","番禺区","白云区","花都区","荔湾区","越秀区","黄埔区",),
            290=>array("乐昌市","乳源瑶族自治县","仁化县","南雄市","始兴县","新丰县","曲江区","武江区","浈江区","翁源县",),
            291=>array("南山区","宝安区","盐田区","福田区","罗湖区","龙岗区",),
            292=>array("斗门区","金湾区","香洲区",),
            293=>array("南澳县","潮南区","潮阳区","澄海区","濠江区","金平区","龙湖区",),
            294=>array("三水区","南海区","禅城区","顺德区","高明区",),
            295=>array("台山市","开平市","恩平市","新会区","江海区","蓬江区","鹤山市",),
            296=>array("吴川市","坡头区","廉江市","徐闻县","赤坎区","遂溪县","雷州市","霞山区","麻章区",),
            297=>array("信宜市","化州市","电白县","茂南区","茂港区","高州市",),
            298=>array("四会市","封开县","广宁县","德庆县","怀集县","端州区","高要市","鼎湖区",),
            299=>array("博罗县","惠东县","惠城区","惠阳区","龙门县",),
            300=>array("丰顺县","五华县","兴宁市","大埔县","平远县","梅县","梅江区","蕉岭县",),
            301=>array("城区","海丰县","陆丰市","陆河县",),
            302=>array("东源县","和平县","源城区","紫金县","连平县","龙川县",),
            303=>array("江城区","阳东县","阳春市","阳西县",),
            304=>array("佛冈县","清城区","清新县","英德市","连南瑶族自治县","连山壮族瑶族自治县","连州市","阳山县",),
            305=>array("东莞市",),
            306=>array("中山市",),
            307=>array("湘桥区","潮安县","饶平县",),
            308=>array("惠来县","揭东县","揭西县","普宁市","榕城区",),
            309=>array("云城区","云安县","新兴县","罗定市","郁南县",),
            310=>array("上林县","兴宁区","宾阳县","横县","武鸣县","江南区","良庆区","西乡塘区","邕宁区","隆安县","青秀区","马山县",),
            311=>array("三江侗族自治县","城中区","柳北区","柳南区","柳城县","柳江县","融安县","融水苗族自治县","鱼峰区","鹿寨县",),
            312=>array("七星区","临桂县","全州县","兴安县","叠彩区","平乐县","恭城瑶族自治县","永福县","灌阳县","灵川县","秀峰区","荔浦县","象山区","资源县","阳朔县","雁山区","龙胜各族自治县",),
            313=>array("万秀区","岑溪市","苍梧县","蒙山县","藤县","蝶山区","长洲区",),
            314=>array("合浦县","海城区","铁山港区","银海区",),
            315=>array("上思县","东兴市","港口区","防城区",),
            316=>array("浦北县","灵山县","钦北区","钦南区",),
            317=>array("平南县","桂平市","港北区","港南区","覃塘区",),
            318=>array("兴业县","北流市","博白县","容县","玉州区","陆川县",),
            319=>array("乐业县","凌云县","右江区","平果县","德保县","田东县","田林县","田阳县","西林县","那坡县","隆林各族自治县","靖西县",),
            320=>array("八步区","富川瑶族自治县","昭平县","钟山县",),
            321=>array("东兰县","凤山县","南丹县","大化瑶族自治县","天峨县","宜州市","巴马瑶族自治县","环江毛南族自治县","罗城仫佬族自治县","都安瑶族自治县","金城江区",),
            322=>array("兴宾区","合山市","忻城县","武宣县","象州县","金秀瑶族自治县",),
            323=>array("凭祥市","大新县","天等县","宁明县","扶绥县","江州区","龙州县",),
            324=>array("琼山区","秀英区","美兰区","龙华区",),
            325=>array("三亚市",),
            326=>array("五指山市",),
            327=>array("琼海市",),
            328=>array("儋州市",),
            329=>array("文昌市",),
            330=>array("万宁市",),
            331=>array("东方市",),
            332=>array("定安县",),
            333=>array("屯昌县",),
            334=>array("澄迈县",),
            335=>array("临高县",),
            336=>array("白沙黎族自治县",),
            337=>array("昌江黎族自治县",),
            338=>array("乐东黎族自治县",),
            339=>array("陵水黎族自治县",),
            340=>array("保亭黎族苗族自治县",),
            341=>array("琼中黎族苗族自治县",),
            385=>array("双流县","大邑县","崇州市","彭州市","成华区","新津县","新都区","武侯区","温江区","蒲江县","邛崃市","郫县","都江堰市","金堂县","金牛区","锦江区","青白江区","青羊区","龙泉驿区",),
            386=>array("大安区","富顺县","沿滩区","自流井区","荣县","贡井区",),
            387=>array("东区","仁和区","盐边县","米易县","西区",),
            388=>array("叙永县","古蔺县","合江县","江阳区","泸县","纳溪区","龙马潭区",),
            389=>array("中江县","什邡市","广汉市","旌阳区","绵竹市","罗江县",),
            390=>array("三台县","北川羌族自治县","安县","平武县","梓潼县","江油市","涪城区","游仙区","盐亭县",),
            391=>array("元坝区","利州区","剑阁县","旺苍县","朝天区","苍溪县","青川县",),
            392=>array("大英县","安居区","射洪县","船山区","蓬溪县",),
            393=>array("东兴区","威远县","市中区","资中县","隆昌县",),
            394=>array("五通桥区","井研县","夹江县","峨眉山市","峨边彝族自治县","市中区","沐川县","沙湾区","犍为县","金口河区","马边彝族自治县",),
            395=>array("仪陇县","南充市嘉陵区","南部县","嘉陵区","营山县","蓬安县","西充县","阆中市","顺庆区","高坪区",),
            396=>array("东坡区","丹棱县","仁寿县","彭山县","洪雅县","青神县",),
            397=>array("兴文县","南溪县","宜宾县","屏山县","江安县","珙县","筠连县","翠屏区","长宁县","高县",),
            398=>array("华蓥市","岳池县","广安区","武胜县","邻水县",),
            399=>array("万源市","大竹县","宣汉县","开江县","渠县","达县","通川区",),
            400=>array("名山县","天全县","宝兴县","汉源县","石棉县","芦山县","荥经县","雨城区",),
            401=>array("南江县","巴州区","平昌县","通江县",),
            402=>array("乐至县","安岳县","简阳市","雁江区",),
            403=>array("九寨沟县","壤塘县","小金县","松潘县","汶川县","理县","红原县","若尔盖县","茂县","金川县","阿坝县","马尔康县","黑水县",),
            404=>array("丹巴县","乡城县","巴塘县","康定县","得荣县","德格县","新龙县","泸定县","炉霍县","理塘县","甘孜县","白玉县","石渠县","稻城县","色达县","道孚县","雅江县",),
            405=>array("会东县","会理县","冕宁县","喜德县","宁南县","布拖县","德昌县","昭觉县","普格县","木里藏族自治县","甘洛县","盐源县","美姑县","西昌","越西县","金阳县","雷波县",),
            406=>array("乌当区","云岩区","修文县","南明区","小河区","开阳县","息烽县","清镇市","白云区","花溪区",),
            407=>array("六枝特区","水城县","盘县","钟山区",),
            408=>array("习水县","仁怀市","余庆县","凤冈县","务川仡佬族苗族自治县","桐梓县","正安县","汇川区","湄潭县","红花岗区","绥阳县","赤水市","道真仡佬族苗族自治县","遵义县",),
            409=>array("关岭布依族苗族自治县","平坝县","普定县","紫云苗族布依族自治县","西秀区","镇宁布依族苗族自治县",),
            410=>array("万山特区","印江土家族苗族自治县","德江县","思南县","松桃苗族自治县","江口县","沿河土家族自治县","玉屏侗族自治县","石阡县","铜仁市",),
            411=>array("兴义市","兴仁县","册亨县","安龙县","普安县","晴隆县","望谟县","贞丰县",),
            412=>array("大方县","威宁彝族回族苗族自治县","毕节市","纳雍县","织金县","赫章县","金沙县","黔西县",),
            413=>array("三穗县","丹寨县","从江县","凯里市","剑河县","台江县","天柱县","岑巩县","施秉县","榕江县","锦屏县","镇远县","雷山县","麻江县","黄平县","黎平县",),
            414=>array("三都水族自治县","平塘县","惠水县","独山县","瓮安县","福泉市","罗甸县","荔波县","贵定县","都匀市","长顺县","龙里县",),
            415=>array("东川区","五华区","呈贡县","安宁市","官渡区","宜良县","富民县","寻甸回族彝族自治县","嵩明县","晋宁县","盘龙区","石林彝族自治县","禄劝彝族苗族自治县","西山区",),
            416=>array("会泽县","宣威市","富源县","师宗县","沾益县","罗平县","陆良县","马龙县","麒麟区",),
            417=>array("元江哈尼族彝族傣族自治县","华宁县","峨山彝族自治县","新平彝族傣族自治县","易门县","江川县","澄江县","红塔区","通海县",),
            418=>array("施甸县","昌宁县","腾冲县","隆阳区","龙陵县",),
            419=>array("大关县","威信县","巧家县","彝良县","昭阳区","水富县","永善县","盐津县","绥江县","镇雄县","鲁甸县",),
            420=>array("华坪县","古城区","宁蒗彝族自治县","永胜县","玉龙纳西族自治县",),
            422=>array("临翔区","云县","凤庆县","双江拉祜族佤族布朗族傣族自治县","永德县","沧源佤族自治县","耿马傣族佤族自治县","镇康县",),
            423=>array("元谋县","南华县","双柏县","大姚县","姚安县","楚雄市","武定县","永仁县","牟定县","禄丰县",),
            424=>array("个旧市","元阳县","屏边苗族自治县","建水县","开远市","弥勒县","河口瑶族自治县","泸西县","石屏县","红河县","绿春县","蒙自县","金平苗族瑶族傣族自治县",),
            425=>array("丘北县","富宁县","广南县","文山县","砚山县","西畴县","马关县","麻栗坡县",),
            426=>array("勐海县","勐腊县","景洪市",),
            427=>array("云龙县","剑川县","南涧彝族自治县","大理市","宾川县","巍山彝族回族自治县","弥渡县","永平县","洱源县","漾濞彝族自治县","祥云县","鹤庆县",),
            428=>array("梁河县","潞西市","瑞丽市","盈江县","陇川县",),
            430=>array("德钦县","维西傈僳族自治县","香格里拉县",),
            431=>array("城关区","堆龙德庆县","墨竹工卡县","尼木县","当雄县","曲水县","林周县","达孜县",),
            432=>array("丁青县","八宿县","察雅县","左贡县","昌都县","江达县","洛隆县","类乌齐县","芒康县","贡觉县","边坝县",),
            433=>array("乃东县","加查县","扎囊县","措美县","曲松县","桑日县","洛扎县","浪卡子县","琼结县","贡嘎县","错那县","隆子县",),
            434=>array("亚东县","仁布县","仲巴县","南木林县","吉隆县","定日县","定结县","岗巴县","康马县","拉孜县","日喀则市","昂仁县","江孜县","白朗县","聂拉木县","萨嘎县","萨迦县","谢通门县",),
            435=>array("嘉黎县","安多县","尼玛县","巴青县","比如县","班戈县","申扎县","索县","聂荣县","那曲县",),
            436=>array("噶尔县","措勤县","改则县","日土县","普兰县","札达县","革吉县",),
            437=>array("墨脱县","察隅县","工布江达县","朗县","林芝县","波密县","米林县",),
            438=>array("临潼区","周至县","户县","新城区","未央区","灞桥区","碑林区","莲湖区","蓝田县","长安区","阎良区","雁塔区","高陵县",),
            439=>array("印台区","宜君县","王益区","耀州区",),
            440=>array("凤县","凤翔县","千阳县","太白县","岐山县","扶风县","渭滨区","眉县","金台区","陇县","陈仓区","麟游县",),
            441=>array("三原县","干县","兴平市","彬县","旬邑县","杨陵区","武功县","永寿县","泾阳县","淳化县","渭城区","礼泉县","秦都区","长武县",),
            442=>array("临渭区","华县","华阴市","合阳县","大荔县","富平县","潼关县","澄城县","白水县","蒲城县","韩城市",),
            443=>array("吴起县","子长县","安塞县","宜川县","宝塔区","富县","延川县","延长县","志丹县","洛川县","甘泉县","黄陵县","黄龙县",),
            444=>array("佛坪县","勉县","南郑县","城固县","宁强县","汉台区","洋县","留坝县","略阳县","西乡县","镇巴县",),
            445=>array("佳县","吴堡县","子洲县","定边县","府谷县","榆林市榆阳区","横山县","清涧县","神木县","米脂县","绥德县","靖边县",),
            446=>array("宁陕县","岚皋县","平利县","旬阳县","汉滨区","汉阴县","白河县","石泉县","紫阳县","镇坪县",),
            447=>array("丹凤县","商南县","商州区","山阳县","柞水县","洛南县","镇安县",),
            448=>array("七里河区","城关区","安宁区","榆中县","永登县","皋兰县","红古区","西固区",),
            449=>array("嘉峪关市",),
            450=>array("永昌县","金川区",),
            451=>array("会宁县","平川区","景泰县","白银区","靖远县",),
            452=>array("张家川回族自治县","武山县","清水县","甘谷县","秦安县","秦州区","麦积区",),
            453=>array("凉州区","古浪县","天祝藏族自治县","民勤县",),
            454=>array("临泽县","山丹县","民乐县","甘州区","肃南裕固族自治县","高台县",),
            455=>array("华亭县","崆峒区","崇信县","庄浪县","泾川县","灵台县","静宁县",),
            456=>array("敦煌市","玉门市","瓜州县（原安西县）","肃北蒙古族自治县","肃州区","金塔县","阿克塞哈萨克族自治县",),
            457=>array("华池县","合水县","宁县","庆城县","正宁县","环县","西峰区","镇原县",),
            458=>array("临洮县","安定区","岷县","渭源县","漳县","通渭县","陇西县",),
            459=>array("两当县","宕昌县","康县","徽县","成县","文县","武都区","礼县","西和县",),
            460=>array("东乡族自治县","临夏县","临夏市","和政县","广河县","康乐县","永靖县","积石山保安族东乡族撒拉族自治县",),
            461=>array("临潭县","卓尼县","合作市","夏河县","玛曲县","碌曲县","舟曲县","迭部县",),
            462=>array("城东区","城中区","城北区","城西区","大通回族土族自治县","湟中县","湟源县",),
            463=>array("乐都县","互助土族自治县","化隆回族自治县","平安县","循化撒拉族自治县","民和回族土族自治县",),
            464=>array("刚察县","海晏县","祁连县","门源回族自治县",),
            465=>array("同仁县","尖扎县","河南蒙古族自治县","泽库县",),
            466=>array("共和县","兴海县","同德县","贵南县","贵德县",),
            467=>array("久治县","玛多县","玛沁县","班玛县","甘德县","达日县",),
            468=>array("囊谦县","曲麻莱县","杂多县","治多县","玉树县","称多县",),
            469=>array("乌兰县","冷湖行委","大柴旦行委","天峻县","德令哈市","格尔木市","茫崖行委","都兰县",),
            470=>array("兴庆区","永宁县","灵武市","西夏区","贺兰县","金凤区",),
            471=>array("大武口区","平罗县","惠农区",),
            472=>array("利通区","同心县","盐池县","青铜峡市",),
            473=>array("原州区","彭阳县","泾源县","西吉县","隆德县",),
            474=>array("中宁县","沙坡头区","海原县",),
            475=>array("东山区","乌鲁木齐县","天山区","头屯河区","新市区","水磨沟区","沙依巴克区","达坂城区",),
            476=>array("乌尔禾区","克拉玛依区","独山子区","白碱滩区",),
            477=>array("吐鲁番市","托克逊县","鄯善县",),
            478=>array("伊吾县","哈密市","巴里坤哈萨克自治县",),
            479=>array("吉木萨尔县","呼图壁县","奇台县","昌吉市","木垒哈萨克自治县","玛纳斯县","米泉市","阜康市",),
            480=>array("博乐市","温泉县","精河县",),
            481=>array("博湖县","和硕县","和静县","尉犁县","库尔勒市","焉耆回族自治县","若羌县","轮台县",),
            482=>array("乌什县","库车县","拜城县","新和县","柯坪县","沙雅县","温宿县","阿克苏市","阿瓦提县",),
            483=>array("乌恰县","阿克陶县","阿合奇县","阿图什市",),
            484=>array("伽师县","叶城县","喀什市","塔什库尔干塔吉克自治县","岳普湖县","巴楚县","泽普县","疏勒县","疏附县","英吉沙县","莎车县","麦盖提县",),
            485=>array("于田县","和田县","和田市","墨玉县","民丰县","洛浦县","皮山县","策勒县",),
            486=>array("伊宁县","伊宁市","奎屯市","察布查尔锡伯自治县","尼勒克县","巩留县","新源县","昭苏县","特克斯县","霍城县",),
            487=>array("乌苏市","和布克赛尔蒙古自治县","塔城市","托里县","沙湾县","裕民县","额敏县",),
            488=>array("吉木乃县","哈巴河县","富蕴县","布尔津县","福海县","阿勒泰市","青河县",),
            489=>array("石河子市",),
            490=>array("阿拉尔市",),
            491=>array("图木舒克市",),
            492=>array("五家渠市",),
        );
    }

    static function getProvinceId(&$address, &$arr){
        $all_provinces = self::initProvinces();
        $province_preg = implode('|', $all_provinces);
        if (preg_match('/('.$province_preg.')/u', $address, $matches)) {
            $province = $matches[1];
        }
        else {
            $arr['5province'] = '';
            $arr['6city'] = '';
            $arr['7area'] = '';
            $arr['8detail'] = '';
            return false;
        }

        $provinceid = array_search($province, $all_provinces);

        $address = mb_substr($address, mb_strlen($province));
        if (mb_strpos($address, '省') === 0){
            $address = mb_substr($address, mb_strlen('省'));
            $province .= '省';
        }
        if (mb_strpos($address, '市') === 0){
            $address = mb_substr($address, mb_strlen('市'));
            $province .= '市';
        }
        $arr['5province'] = $province;
        return $provinceid;
    }

    static function getCityIdByProvinceId($provinceid, &$address, &$arr){
        $allcitys = self::initCitys();
        $citys = $allcitys[$provinceid];
        foreach($citys as &$city) {
            if (mb_strpos($city, '市')>0 && mb_strlen($city) >= 6){
                $city = mb_substr($city, 0, mb_strpos($city, '市'));
            }
        }
        $city_preg = implode('|', $citys);
        if (preg_match('/('.$city_preg.')/u', $address, $matches)){
            $city = $matches[1];
            $cityid = array_search( $city, $citys);
            $address = mb_substr($address, mb_strlen($city));
            if (mb_strpos($address, '市') === 0){
                $address = mb_substr($address, mb_strlen('市'));
                $city .= '市';
            }
            $arr['6city'] = $city;
            return $cityid;
        }
        elseif (preg_match('/([^市]+[市])(.*)$/u', $address, $matches)) {
            $arr['6city'] = $matches[1];
            $arr['7area'] = '';
            $arr['8detail'] = $matches[2];
            return false;
        }
        else {
            $arr['6city'] = '';
            $arr['7area'] = '';
            $arr['8detail'] = $address;
            return false;
        }
    }

    static function getAreaByCityId($cityid, &$address, &$arr) {
        $all_areas = self::initAreas();
        $areas = $all_areas[$cityid];
        foreach($areas as &$area) {
            if(mb_strlen($area) >=6 ){
                if (mb_strpos($area, '县') > 0){
                    $area = mb_substr($area, 0, mb_strpos($area, '县'));
                }
                if (mb_strpos($area, '市') > 0){
                    $area = mb_substr($area, 0, mb_strpos($area, '市'));
                }
                if (mb_strpos($area, '区') > 0) {
                    $area = mb_substr($area, 0, mb_strpos($area, '区'));
                }
                if (mb_strpos($area, '镇') > 0){
                    $area = mb_substr($area, 0, mb_strpos($area, '镇'));
                }
            }
        }
        $area_preg = implode('|', $areas);
        if(preg_match('/([^区镇县市旗]*[区镇县市旗])(.*)$/u', $address, $matches)) {
            $arr['7area'] = $matches[1];
            $arr['8detail'] = $matches[2];
        }
        elseif (preg_match('/('.$area_preg.')/u', $address, $matches)){
            $arr['7area'] = $matches[1];
            $arr['8detail'] = mb_substr($address, mb_strlen($arr['7area']));
        }
        else {
            $arr['7area'] = '';
            $arr['8detail'] = '';
        }

    }


    //传入一个地址，获取省市区详细地址
    static function explodeAddress($address, &$arr) {

        $arr['5address'] = $address;
        $address = str_replace(array(" ", "&nbsp;", "\t"), '', trim($address));

        $provinceid = self::getProvinceId($address, $arr);
        if(!$provinceid) return;

        $cityid = self::getCityIdByProvinceId($provinceid, $address, $arr);
        if (!$cityid) return;

        self::getAreaByCityId($cityid, $address, $arr);

        ksort($arr);

    }

}
/*** unit test ***/
$addresses = array(
    '内蒙古呼和浩特市回民区北二环路财院西区',
);
foreach($addresses  as $address) {
    $arr = array();
    Address::explodeAddress($address, $arr);
    print_r($arr); 
}

/***** test end ***/
